It causes a recreation of the resource when done through Terraform

```
resource "alicloud_mongodb_instance" "mongodb-quality" {
  name = "test"
  engine_version      = "4.2"
  db_instance_class   = "dds.mongo.mid"
  db_instance_storage = 10
  vswitch_id          = "vsw-aaaaaaa"
  security_group_id = "XXXXXXXXX"
  ssl_action = "Open"
  tde_status = "enabled"
}
```

```
-/+ resource "alicloud_mongodb_instance" "mongodb-quality" {
      ~ backup_period        = [
          - "Friday",
          - "Monday",
          - "Saturday",
          - "Sunday",
          - "Thursday",
          - "Tuesday",
          - "Wednesday",
        ] -> (known after apply)
      ~ backup_time          = "18:00Z-19:00Z" -> (known after apply)
      ~ id                   = "dds-XXX" -> (known after apply)
      ~ maintain_end_time    = "22:00Z" -> (known after apply)
      ~ maintain_start_time  = "18:00Z" -> (known after apply)
        name                 = "test"
      + period               = (known after apply)
      ~ replica_set_name     = "mgset-XXXX" -> (known after apply)
      ~ replication_factor   = 3 -> (known after apply)
      + retention_period     = (known after apply)
      + security_group_id    = "sg-XXX"
      ~ security_ip_list     = [

          - "127.0.0.1",

        ] -> (known after apply)
      + ssl_action           = "Open"
      ~ ssl_status           = "Closed" -> (known after apply)
      ~ storage_engine       = "WiredTiger" -> (known after apply)
      - tags                 = {} -> null
      ~ zone_id              = "cn-shanghai-f" -> (known after apply)
        # (6 unchanged attributes hidden)
    }
```